// Задайте одномерный массив из 10 целых чисел от 1 до 100.
// Найдите количество элементов массива,
// значения которых лежат в отрезке [20,90].
// Пример:
// массив [10 21 14 93 23] => 2

int[] arr = { 0, 21, 14, 93, 23, 8, 97, 33, 75, 76 };
int countArr = 0;
for (int i = 0; i < arr.Length; i++)
    if (arr[i] >= 20 && arr[i] <= 90)
    {
        countArr++;
    }
Console.Write($"Массив [ {string.Join(", ", arr)} ] => {countArr}");